"use client";
import React from "react";

const TermOfUse = () => {
  return (
    <div className="max-w-4xl mx-auto bg-white rounded-lg shadow-md p-4 sm:p-6">
    <h1 className="text-xl sm:text-2xl font-semibold text-gray-800 mb-4 sm:mb-6">เงื่อนไขการใช้บริการ (Terms of Service)</h1>
    <p className="text-sm sm:text-base text-gray-600 leading-relaxed">
        เงื่อนไขการใช้บริการฉบับนี้มีวัตถุประสงค์เพื่อแจ้งถึงสิทธิและหน้าที่ตามกฏหมายระหว่าง
        <span className="font-semibold">
          “เรา” “APSTH (บ.เอพีเอส ทีเอช จำกัด)”
        </span>{" "}
        ในฐานะ “ผู้ให้บริการ” และ “ท่าน” ในฐานะ “ผู้ใช้บริการ” ดังนั้น
        โปรดอ่านรายละเอียดให้ครบถ้วนเพื่อประโยชน์ในการรับบริการของท่าน
      </p>
      <p className="mt-4 text-gray-600 leading-relaxed">
        <span className="font-semibold">1. การเก็บรวบรวมข้อมูลส่วนบุคคล</span>
        <br />
        1.1 “ข้อตกลง” คือ เงื่อนไขการใช้บริการ, สัญญา, ภายใต้ข้อกำหนด
        นโยบายความเป็นส่วนตัว (Privacy Policy)
        <br />
        1.2 “คู่สัญญา” คือ APSTH (บ.เอพีเอส ทีเอช จำกัด) และ
        ผู้ใช้บริการที่สมัครเข้าใช้บริการผ่านทางเว็บไซต์ www.apsth.com หรือ
        แอปพลิเคชั่น APSTH หรือ ที่อยู่ภายใต้การดูแลของ บริษัททั้งหมด
        <br />
        1.3 “ค่าบริการ” คือ
        ค่าบริการรายปีที่ผู้ใช้บริการมีหน้าที่ต้องชำระตามรอบที่กำหนดตามสัญญา
        ตามราคาที่ปรากฏในใบเสนอราคา
        <br />
        1.4 “ข้อมูล” คือ
        ข้อมูลใดๆที่ผู้ใช้บริการหรือผู้ที่ได้รับมอบอำนาจจากผู้ใช้บริการให้ทำการแทนได้ไว้ให้แก่ทาง
        APSTH (บ.เอพีเอส ทีเอช จำกัด)
        <br />
        1.5 “ข้อมูลลับ” คือ ข้อมูลต่างๆที่คู่สัญญาได้ให้ไว้แก่กัน
        ไม่ว่าจะโดยทางวาจา, ลายลักษณ์อักษร หรือข้อมูลอิเลคทรอนิคส์
        แต่ไม่รวมถึงข้อมูลใดๆ ที่ได้ถูกเผยแพร่สู่สาธารณเป็นที่เรียบร้อยแล้ว
        <br />
        1.6 “การให้บริการ” คือ การให้บริการซอฟต์แวร์ ระบบ หรือโปรแกรมคลินิก APS
        Platform ออนไลน์ ที่เหมาะสำหรับ รองรับหลากหลายประเภทธุรกิจ อาทิเช่น
        Clinic, Spa, Wellness, Hospital, Beauty, ศูนย์ดูแลผู้สูงอายุ
      </p>
      <p className="mt-4 text-gray-600 leading-relaxed">
        <span className="font-semibold">2. การสมัครใช้งาน</span>
        <br />
        2.1 ผู้ใช้งานที่จะใช้บริการต้องมีอายุ 18 ปี บริบูรณ์ขึ้นไป
        <br />
        2.2 ผู้ใช้งานจะต้องรับผิดชอบดูแล username และรหัสผ่าน
        เพื่อความปลอดภัยของระบบ
        <br />
        2.3 ผู้ใช้งานจะต้องไม่ทำการคัดลอกเนื้อหา, ดัดแปลงแก้ไข
        หรือนำไปจำหน่ายต่อบุคคลอื่น
        <br />
        2.4 ผู้ใช้งานยอมรับให้ APSTH (บ.เอพีเอส ทีเอช จำกัด)
        สามารถแก้ไขรายการข้อมูลที่ส่งเข้าระบบได้
      </p>
      <p className="mt-4 text-gray-600 leading-relaxed">
        <span className="font-semibold">3. การต่อสัญญา</span>
        <br />
        การต่อสัญญา ระยะเวลาในการใช้บริการแพ็กเกจของ www.apsth.com
        จะกำหนดไว้ที่เอกสารยืนยันการสั่งซื้อหรือใบเสนอราคาเท่านั้น
        โดยเมื่อใกล้วันสิ้นสุดสัญญา APSTH (บ.เอพีเอส ทีเอช จำกัด)
        จะทำการแจ้งเตือนไปยังผู้ใช้บริการก่อนสิ้นสุดระยะเวลาในการใช้บริการ
      </p>
      <p className="mt-4 text-gray-600 leading-relaxed">
        <span className="font-semibold">4. การเลิกสัญญา</span>
        <br />
        การเลิกสัญญา ผู้ใช้บริการมีสิทธิเลิกสัญญาได้โดย
        การส่งคำขอเลิกใช้งานมายัง apsth456@gmail.com
        การยื่นคำขอดังกล่าวจะมีผลในระยะเวลาการใช้บริการในวันสุดท้ายของสัญญาดังกล่าว
        ในกรณีที่ท่านมีความประสงค์จะเลิกสัญญาโดยให้มีผลในทันที
        (ก่อนสิ้นสุดระยะเวลาการใช้บริการ)
        จะไม่คืนเงินค่าบริการที่ท่านได้ชำระไว้แล้วไม่ว่ากรณีใดๆ
      </p>
      <p className="mt-4 text-gray-600 leading-relaxed">
        <span className="font-semibold">5. การซื้อแพ็คเกจ</span>
        <br />
        5.1 ผู้ใช้งานที่สมัครใหม่จะได้ทดลองใช้งานฟรี ตามจำนวนวันที่ APSTH
        (บ.เอพีเอส ทีเอช จำกัด) กำหนดให้ ก่อนการตัดสินใจใช้งานจริง
        โดยไม่สามารถเพิ่มจำนวนวันได้อีก
        <br />
        5.2 การชำระเงินจะเป็นการชำระเงินก่อนใช้งาน
        และเมื่อผู้ใช้บริการชำระเงินตามจำนวนที่ต้องการแล้ว APSTH (บ.เอพีเอส
        ทีเอช จำกัด) จะเพิ่มวันตามจำนวนเงินที่โอนโดยทาง APSTH (บ.เอพีเอส ทีเอช
        จำกัด) จะไม่เปลี่ยนแปลงภายหลังจนกว่าจะหมดอายุ
        <br />
        5.3
        ผู้ใช้งานที่เคยสมัครแล้วจะไม่ได้รับโปรโมชั่นใหม่ที่ออกมาหลังจากวันที่สมัคร
        <br />
        5.4 ผู้ใช้งานที่เคยสมัครแล้วจะไม่สามารถสมัครซํ้าได้อีก หรือ
        ไม่สามารถเปลี่ยนชื่อ username เพื่อรับการทดลองฟรี-โปรโมชั่นอื่นๆ
      </p>
      <p className="mt-4 text-gray-600 leading-relaxed">
        <span className="font-semibold">
          6. การคืนเงิน/การเปลี่ยนแปลงบริการ/ยกเลิก
        </span>
        <br />
        6.1 สำหรับค่าแพ็คเก็จที่ไดซื้อไปแล้ว นโยบายการคืนเงิน :
        การชำระเงินในการซื้อสินค้า ทาง APSTH (บ.เอพีเอส ทีเอช จำกัด)
        ขอสงวนสิทธิ์การคืนเงินในทุกกรณี
        <br />
        6.2 APSTH (บ.เอพีเอส ทีเอช จำกัด)
        ขอสงวนสิทธิ์ในการเปลี่ยนแปลงราคาโดยไม่ต้องแจ้งให้ทราบล่วงหน้า
        <br />
        6.3 ในกรณีเปลี่ยนแปลงค่าบริการ จะมีการแจ้งเตือนให้ผู้ใช้งาน (ลูกค้าเก่า)
        ทราบล่วงหน้า 30 วันทุกครั้ง และ
        สำหรับผู้ใช้งานที่ซื้อแพ็คเก็จระยะยาวจะไม่มีผลกระทบกับจำนวนวันที่ได้ซื้อก่อนหน้านี้
        <br />
        6.4 นโยบายการยกเลิกคำสั่งซื้อสินค้า: หากลูกค้าต้องการยกเลิกคำสั่งซื้อ
        อาทิเช่น เปลี่ยนใจ ทาง APSTH (บ.เอพีเอส ทีเอช จำกัด)
        ขอสงวนสิทธิ์การยกเลิกในทุกกรณี
        <br />
        6.5 นโยบายการจัดส่งสินค้า :
        ระยะเวลาการจัดส่งสินค้าหลังจากที่ลูกค้าชำระเงินเป็นที่เรียบร้อย / สำเร็จ
        โดยมีช่องทางเลือกรับสินค้า ได้แก่ ที่ร้านค้า/คลินิก
        และจัดส่งไปยังที่อยู่ในการสั่งซื้อ โดยระยะเวลาการจัดส่ง 5-7
        วันแต่ไม่เกิน 10 วัน
        <br />
        6.6 นโยบายการคืนสินค้า: ทาง APSTH (บ.เอพีเอส ทีเอช
        จำกัด)ขอสงวนสิทธิ์การคืนสินค้าในทุกกรณี
      </p>
      <p className="mt-4 text-gray-600 leading-relaxed">
        <span className="font-semibold">7. การโอนสิทธิ์การใช้งาน</span>
        <br />
        APSTH (บ.เอพีเอส ทีเอช จำกัด)
        ไม่อนุญาตให้ท่านโอนสิทธิและหน้าที่ที่เกิดขึ้นที่เกิดขึ้นภายใต้สัญญา
        ให้แก่บุคคลอื่นโดยมิได้รับความยินยอมเป็นลายลักษณ์อักษรจากทาง APSTH
        (บ.เอพีเอส ทีเอช จำกัด) เท่านั้น
      </p>
      <p className="mt-4 text-gray-600 leading-relaxed">
        <span className="font-semibold text-md">แก้ไขครั้งล่าสุดเมื่อวันที่ 25 พฤษภาคม 2565</span>
      </p>
    </div>
  );
};

export default TermOfUse;
